<a href="https://colab.research.google.com/github/manik910/Python-practice/blob/main/0wns.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd

df1 = pd.read_csv("sales8.csv")
df2 = df1.drop([1, 2], axis = 0)
df3 = df1.drop(columns='Order Id')

print(df1.head())
print()
print(df2.head())
print(df3.head())

   Order Id Customer name  Customer Id                Product name  \
0    192837         Veeru            3                   LG Mobile
1    192838       Neelima           19        Apple iPad 10.2-inch
2    192839        Balaji           12      34in Ultrawide Monitor
3    192840        Shahid           20                   iPhone 11
4    192841         Vinay           10  Bose SoundSport Headphones

   Product cost  Quantity
0         65999         1
1         63000         2
2         75999         1
3         60000         2
4         69999         3

   Order Id Customer name  Customer Id                Product name  \
0    192837         Veeru            3                   LG Mobile
3    192840        Shahid           20                   iPhone 11
4    192841         Vinay           10  Bose SoundSport Headphones
5    192842         Vinay           10                20in Monitor
6    192843        Balaji           12                    iPhone 8

   Product cost  Quantity
0         65999         1
3         60000         2
4         69999         3
5         65999         2
6         55999         3
  Customer name  Customer Id                Product name  Product cost  \
0         Veeru            3                   LG Mobile         65999
1       Neelima           19        Apple iPad 10.2-inch         63000
2        Balaji           12      34in Ultrawide Monitor         75999
3        Shahid           20                   iPhone 11         60000
4         Vinay           10  Bose SoundSport Headphones         69999

   Quantity
0         1
1         2
2         1
3         2
4         3

In [10]:
import pandas as pd

df = pd.read_csv("sales8.csv")

print(df.head())

new = df['Product cost']
df.insert(4,"Total Cost", new)

print()
print(df.head(5))

   Order Id Customer name  Customer Id                Product name  \
0    192837         Veeru            3                   LG Mobile
1    192838       Neelima           19        Apple iPad 10.2-inch
2    192839        Balaji           12      34in Ultrawide Monitor
3    192840        Shahid           20                   iPhone 11
4    192841         Vinay           10  Bose SoundSport Headphones

   Product cost  Quantity
0         65999         1
1         63000         2
2         75999         1
3         60000         2
4         69999         3

   Order Id Customer name  Customer Id                Product name  \
0    192837         Veeru            3                   LG Mobile
1    192838       Neelima           19        Apple iPad 10.2-inch
2    192839        Balaji           12      34in Ultrawide Monitor
3    192840        Shahid           20                   iPhone 11
4    192841         Vinay           10  Bose SoundSport Headphones

   Total Cost  Product cost  Quantity
0       65999         65999         1
1       63000         63000         2
2       75999         75999         1
3       60000         60000         2
4       69999         69999         3

In [16]:
import pandas as pd

data = {
        'Product': ['Samsung', 'iPhone', 'Motorola'],
        'Status': ['Success', 'Success', 'Failed'],
        'Cost': [10000, 50000, 15000],
        'PurDate': ['2018-01-01','1996-10-27','1998-03-12'],
}

df = pd.DataFrame(data)
df['PurDate'] = pd.to_datetime(df['PurDate'])

print(df.head())
print()
print(df["PurDate"].dt.day_name())

    Product   Status   Cost    PurDate
0   Samsung  Success  10000 2018-01-01
1    iPhone  Success  50000 1996-10-27
2  Motorola   Failed  15000 1998-03-12

0      Monday
1      Sunday
2    Thursday
Name: PurDate, dtype: object